import img from '../../../images/author_img.png'
import styles from './bodyContent.module.css'

const BodyContent = () => {

    const count = [1, 2]

    return (
        <div className={styles.content_wrapper}>
            <div className={styles.content_wrapper_title}>
                <h3 className={styles.content_title}>Список последних <br /> ответов на вопросы <span className={styles.content_title_count}>(12 493)</span></h3>

                <div className={styles.content_sort}>
                    <svg width="12" height="8" viewBox="0 0 12 8" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M2.33086 0.669167C2.27538 0.61606 2.20997 0.57443 2.13836 0.546667C1.99634 0.488323 1.83705 0.488323 1.69503 0.546667C1.62342 0.57443 1.558 0.61606 1.50253 0.669167L0.33586 1.83583C0.226016 1.94568 0.164307 2.09466 0.164307 2.25C0.164307 2.40534 0.226016 2.55432 0.33586 2.66417C0.445704 2.77401 0.594684 2.83572 0.750027 2.83572C0.905369 2.83572 1.05435 2.77401 1.16419 2.66417L1.33336 2.48917V6.91667C1.33336 7.07138 1.39482 7.21975 1.50421 7.32915C1.61361 7.43854 1.76198 7.5 1.91669 7.5C2.0714 7.5 2.21978 7.43854 2.32917 7.32915C2.43857 7.21975 2.50003 7.07138 2.50003 6.91667V2.48917L2.66919 2.66417C2.72342 2.71884 2.78794 2.76224 2.85902 2.79185C2.93011 2.82147 3.00635 2.83672 3.08336 2.83672C3.16037 2.83672 3.23661 2.82147 3.3077 2.79185C3.37878 2.76224 3.4433 2.71884 3.49753 2.66417C3.5522 2.60994 3.5956 2.54542 3.62521 2.47434C3.65483 2.40325 3.67008 2.32701 3.67008 2.25C3.67008 2.17299 3.65483 2.09675 3.62521 2.02566C3.5956 1.95458 3.5522 1.89006 3.49753 1.83583L2.33086 0.669167ZM5.41669 1.66667H11.25C11.4047 1.66667 11.5531 1.60521 11.6625 1.49581C11.7719 1.38642 11.8334 1.23804 11.8334 1.08333C11.8334 0.928624 11.7719 0.780251 11.6625 0.670854C11.5531 0.561458 11.4047 0.5 11.25 0.5H5.41669C5.26198 0.5 5.11361 0.561458 5.00421 0.670854C4.89482 0.780251 4.83336 0.928624 4.83336 1.08333C4.83336 1.23804 4.89482 1.38642 5.00421 1.49581C5.11361 1.60521 5.26198 1.66667 5.41669 1.66667V1.66667ZM11.25 6.33333H5.41669C5.26198 6.33333 5.11361 6.39479 5.00421 6.50419C4.89482 6.61358 4.83336 6.76196 4.83336 6.91667C4.83336 7.07138 4.89482 7.21975 5.00421 7.32915C5.11361 7.43854 5.26198 7.5 5.41669 7.5H11.25C11.4047 7.5 11.5531 7.43854 11.6625 7.32915C11.7719 7.21975 11.8334 7.07138 11.8334 6.91667C11.8334 6.76196 11.7719 6.61358 11.6625 6.50419C11.5531 6.39479 11.4047 6.33333 11.25 6.33333ZM11.25 3.41667H5.41669C5.26198 3.41667 5.11361 3.47812 5.00421 3.58752C4.89482 3.69692 4.83336 3.84529 4.83336 4C4.83336 4.15471 4.89482 4.30308 5.00421 4.41248C5.11361 4.52187 5.26198 4.58333 5.41669 4.58333H11.25C11.4047 4.58333 11.5531 4.52187 11.6625 4.41248C11.7719 4.30308 11.8334 4.15471 11.8334 4C11.8334 3.84529 11.7719 3.69692 11.6625 3.58752C11.5531 3.47812 11.4047 3.41667 11.25 3.41667Z" fill="#050B2B" />
                    </svg>
                    <button className={styles.sort_btn}>Сортировать по</button>
                </div>

            </div>

            <div className={styles.content_wrapper_searchBlock}>
                <input className={styles.search_input} type="search" placeholder='Искать по тексту в вопросе' />
                <button className={styles.search_btn}>
                    <svg width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M14.4733 13.5267L12 11.0734C12.9601 9.87633 13.425 8.35692 13.2992 6.82759C13.1734 5.29826 12.4664 3.87525 11.3237 2.85115C10.1809 1.82706 8.6892 1.27973 7.15528 1.32171C5.62136 1.36368 4.16181 1.99177 3.07676 3.07682C1.99171 4.16187 1.36362 5.62142 1.32164 7.15534C1.27967 8.68926 1.827 10.181 2.85109 11.3237C3.87519 12.4665 5.2982 13.1735 6.82753 13.2993C8.35686 13.4251 9.87627 12.9601 11.0733 12.0001L13.5267 14.4534C13.5886 14.5159 13.6624 14.5655 13.7436 14.5993C13.8249 14.6332 13.912 14.6506 14 14.6506C14.088 14.6506 14.1751 14.6332 14.2564 14.5993C14.3376 14.5655 14.4114 14.5159 14.4733 14.4534C14.5935 14.3291 14.6607 14.163 14.6607 13.9901C14.6607 13.8172 14.5935 13.651 14.4733 13.5267V13.5267ZM7.33333 12.0001C6.41035 12.0001 5.5081 11.7264 4.74067 11.2136C3.97324 10.7008 3.3751 9.97197 3.02189 9.11925C2.66868 8.26653 2.57627 7.32821 2.75633 6.42297C2.9364 5.51773 3.38085 4.6862 4.0335 4.03356C4.68614 3.38091 5.51766 2.93646 6.42291 2.75639C7.32815 2.57633 8.26646 2.66874 9.11919 3.02195C9.97191 3.37516 10.7007 3.9733 11.2135 4.74073C11.7263 5.50816 12 6.41041 12 7.33339C12 8.57107 11.5083 9.75805 10.6332 10.6332C9.75799 11.5084 8.57101 12.0001 7.33333 12.0001V12.0001Z" fill="white" />
                    </svg>
                    Поиск</button>
            </div>

            {count.map(() => (

                <div>
                    <div className={styles.content_answerQuestion_block}>

                        <div className={styles.content_answerQuestion_inform}>
                            <p className={styles.answerQuestion_number}>Вопрос: 21408</p>
                            <p className={styles.answerQuestion_date}>Январь 27, 2024 9:41 pm</p>
                        </div>

                        <div className={styles.answerQuestion_wrapper}>
                            <div className={styles.content_question_part}>
                                <div className={styles.question_part}>
                                    <div className={styles.question_part_inform}>
                                        <p className={styles.answer_count}>Получено ответов (3)</p>
                                        <p className={styles.answer_owner}>Lorri Warf (26 лет)</p>
                                    </div>
                                    <div className={styles.question_description_part}>
                                        <p className={styles.question_description}>
                                            "Здравствуйте, доктор. В последнее время я заметил(а), что стал(а) быстро уставать и появилась постоянная усталость, несмотря на полноценный сон. К тому же, у меня снизился аппетит, и я замечаю периодические головные боли. Могли бы вы подсказать, что это может быть и какие обследования мне стоит пройти для уточнения... <span className={styles.question_show_fullText}>Читать полностью</span>
                                        </p>
                                    </div>
                                </div>
                                <div className={styles.question_icon}>
                                    <svg width="30" height="31" viewBox="0 0 30 31" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <g clip-path="url(#clip0_2001_418)">
                                            <path d="M29.9838 2.04789C29.9701 1.94008 29.9463 1.83633 29.907 1.73898C29.9057 1.73664 29.9057 1.7332 29.9051 1.73016C29.9051 1.72953 29.9045 1.72891 29.9039 1.72836C29.8605 1.62578 29.8013 1.53273 29.7345 1.44633C29.718 1.42594 29.7019 1.4057 29.6845 1.38656C29.613 1.30594 29.5355 1.23148 29.4455 1.17078C29.4431 1.16891 29.44 1.16836 29.4376 1.16648C29.3505 1.10914 29.2545 1.06578 29.1537 1.03164C29.1287 1.02273 29.1043 1.01516 29.0787 1.00844C28.973 0.979766 28.8645 0.958984 28.75 0.958984H20C19.31 0.958984 18.75 1.51898 18.75 2.20898C18.75 2.89898 19.31 3.45898 20 3.45898H25.7318L18.2712 10.9196C16.2817 9.32852 13.8324 8.45898 11.25 8.45898C5.04703 8.45898 0 13.506 0 19.709C0 25.912 5.04703 30.959 11.25 30.959C17.453 30.959 22.5 25.912 22.5 19.709C22.5 17.1277 21.6312 14.6791 20.0387 12.6878L27.5 5.22656V10.959C27.5 11.649 28.06 12.209 28.75 12.209C29.44 12.209 30 11.649 30 10.959V2.20898C30 2.18273 29.9939 2.15773 29.9923 2.13211C29.9904 2.10392 29.9876 2.07589 29.9838 2.04789ZM11.25 28.459C6.42484 28.459 2.5 24.5341 2.5 19.709C2.5 14.8838 6.42484 10.959 11.25 10.959C13.5861 10.959 15.7855 11.8684 17.4393 13.5163C19.0905 15.1734 20 17.3729 20 19.709C20 24.5341 16.0752 28.459 11.25 28.459Z" fill="white" />
                                        </g>
                                        <defs>
                                            <clipPath id="clip0_2001_418">
                                                <rect width="30" height="30" fill="white" transform="translate(0 0.958984)" />
                                            </clipPath>
                                        </defs>
                                    </svg>
                                </div>
                            </div>

                            <div className={styles.content_answer_part}>
                                <div className={styles.answer_owner_icon}>
                                    <img src={img} alt="author_img" />
                                </div>

                                <div className={styles.answer_part}>
                                    <div className={styles.answer_part_inform}>
                                        <p className={styles.answer_part_owner}>Mary Freund (Гастроинтеролог)</p>
                                        <p className={styles.answer_date}>Январь 28, 2024 9:41 pm</p>
                                    </div>

                                    <div className={styles.answer_description_part}>
                                        <p className={styles.answer_description}>
                                            "Можете ли вы, пожалуйста, объяснить, какие могут быть причины моих текущих симптомов (укажите свои симптомы), какие диагностические тесты вы рекомендуете для подтверждения диагноза, и какие методы лечения или изменения в образе жизни вы считаете наиболее эффективными для улучшения моего... <span className={styles.answer_show_fullText}>Читать полностью</span>
                                        </p>
                                    </div>

                                </div>

                            </div>

                            <button className={styles.btn_show_allAnswers}><span className={styles.allAnswers_text}>Смотреть все ответы (2)</span>
                                <svg width="8" height="4" viewBox="0 0 8 4" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M6.91666 0.349194C6.80736 0.240548 6.65952 0.179565 6.50541 0.179565C6.3513 0.179565 6.20345 0.240548 6.09416 0.349194L3.99999 2.41419L1.93499 0.349194C1.8257 0.240548 1.67785 0.179565 1.52374 0.179565C1.36963 0.179565 1.22179 0.240548 1.11249 0.349194C1.05782 0.403423 1.01442 0.46794 0.984804 0.539025C0.955189 0.610109 0.939941 0.686354 0.939941 0.763361C0.939941 0.840368 0.955189 0.916613 0.984804 0.987698C1.01442 1.05878 1.05782 1.1233 1.11249 1.17753L3.58582 3.65086C3.64005 3.70554 3.70457 3.74893 3.77565 3.77855C3.84674 3.80816 3.92298 3.82341 3.99999 3.82341C4.077 3.82341 4.15324 3.80816 4.22433 3.77855C4.29541 3.74893 4.35993 3.70554 4.41416 3.65086L6.91666 1.17753C6.97133 1.1233 7.01473 1.05878 7.04434 0.987698C7.07396 0.916613 7.08921 0.840368 7.08921 0.763361C7.08921 0.686354 7.07396 0.610109 7.04434 0.539025C7.01473 0.46794 6.97133 0.403423 6.91666 0.349194Z" fill="#747474" />
                                </svg>
                            </button>
                        </div>

                    </div>

                    <div className={styles.content_answerQuestion_block}>

                        <div className={styles.content_answerQuestion_inform}>
                            <p className={styles.answerQuestion_number}>Вопрос: 21408</p>
                            <p className={styles.answerQuestion_date}>Январь 27, 2024 9:41 pm</p>
                        </div>

                        <div className={styles.answerQuestion_wrapper}>
                            <div className={styles.content_question_part}>
                                <div className={styles.question_part}>
                                    <div className={styles.question_part_inform}>
                                        <p className={styles.answer_count}>Получено ответов (3)</p>
                                        <p className={styles.answer_owner}>Kimberly Mastrangelo (24 лет)</p>
                                    </div>
                                    <div className={styles.question_description_part}>
                                        <p className={styles.question_description}>
                                            "Здравствуйте, доктор. В последнее время я заметил(а), что стал(а) быстро уставать и появилась постоянная усталость, несмотря на полноценный сон. К тому же, у меня снизился аппетит, и я замечаю периодические головные боли. Могли бы вы подсказать, что это может быть и какие обследования мне стоит пройти для уточнения... <span className={styles.question_show_fullText}>Читать полностью</span>
                                        </p>
                                    </div>
                                </div>
                                <div className={`${styles.question_icon} ${styles.qi_2}`}>
                                    <svg width="20" height="31" viewBox="0 0 20 31" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path d="M17.0467 17.9613C20.9323 14.077 20.9323 7.75662 17.0467 3.87226C13.1612 -0.0121498 6.8389 -0.0121498 2.95325 3.87226C-0.932334 7.75662 -0.932334 14.077 2.95325 17.9613C4.59798 19.6055 6.67929 20.5535 8.82751 20.8058V24.1411H6.48271C5.83519 24.1411 5.3103 24.6659 5.3103 25.3132C5.3103 25.9605 5.83519 26.4852 6.48271 26.4852H8.82751V29.7869C8.82757 30.4342 9.35245 30.9589 10 30.9589C10.6475 30.9589 11.1724 30.4342 11.1724 29.7869V26.4852H13.5173C14.1648 26.4852 14.6897 25.9605 14.6897 25.3132C14.6897 24.6659 14.1648 24.1411 13.5173 24.1411H11.1724V20.8059C13.3207 20.5535 15.402 19.6055 17.0467 17.9613ZM4.61134 16.3037C1.63999 13.3333 1.63999 8.50017 4.61134 5.52976C7.58263 2.55947 12.4173 2.5593 15.3887 5.52976C18.3601 8.50017 18.3601 13.3333 15.3887 16.3037C12.4174 19.2741 7.58269 19.2741 4.61134 16.3037Z" fill="white" />
                                    </svg>

                                </div>
                            </div>

                            <div className={styles.content_answer_part}>
                                <div className={styles.answer_owner_icon}>
                                    <img src={img} alt="author_img" />
                                </div>

                                <div className={styles.answer_part}>
                                    <div className={styles.answer_part_inform}>
                                        <p className={styles.answer_part_owner}>Mary Freund (Гастроинтеролог)</p>
                                        <p className={styles.answer_date}>Январь 28, 2024 9:41 pm</p>
                                    </div>

                                    <div className={styles.answer_description_part}>
                                        <p className={styles.answer_description}>
                                            "Можете ли вы, пожалуйста, объяснить, какие могут быть причины моих текущих симптомов (укажите свои симптомы), какие диагностические тесты вы рекомендуете для подтверждения диагноза, и какие методы лечения или изменения в образе жизни вы считаете наиболее эффективными для улучшения моего... <span className={styles.answer_show_fullText}>Читать полностью</span>
                                        </p>
                                    </div>

                                </div>

                            </div>

                            <button className={styles.btn_show_allAnswers}><span className={styles.allAnswers_text}>Смотреть все ответы (2)</span>
                                <svg width="8" height="4" viewBox="0 0 8 4" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M6.91666 0.349194C6.80736 0.240548 6.65952 0.179565 6.50541 0.179565C6.3513 0.179565 6.20345 0.240548 6.09416 0.349194L3.99999 2.41419L1.93499 0.349194C1.8257 0.240548 1.67785 0.179565 1.52374 0.179565C1.36963 0.179565 1.22179 0.240548 1.11249 0.349194C1.05782 0.403423 1.01442 0.46794 0.984804 0.539025C0.955189 0.610109 0.939941 0.686354 0.939941 0.763361C0.939941 0.840368 0.955189 0.916613 0.984804 0.987698C1.01442 1.05878 1.05782 1.1233 1.11249 1.17753L3.58582 3.65086C3.64005 3.70554 3.70457 3.74893 3.77565 3.77855C3.84674 3.80816 3.92298 3.82341 3.99999 3.82341C4.077 3.82341 4.15324 3.80816 4.22433 3.77855C4.29541 3.74893 4.35993 3.70554 4.41416 3.65086L6.91666 1.17753C6.97133 1.1233 7.01473 1.05878 7.04434 0.987698C7.07396 0.916613 7.08921 0.840368 7.08921 0.763361C7.08921 0.686354 7.07396 0.610109 7.04434 0.539025C7.01473 0.46794 6.97133 0.403423 6.91666 0.349194Z" fill="#747474" />
                                </svg>
                            </button>
                        </div>

                    </div>

                </div>

            ))}

            <div className={styles.pagination_block}>
                <ul className={styles.pagination_num}>
                    <li><button className={`${styles.pagination_num_btn} ${styles.pagination_num_btn1}`}>
                        <svg width="5" height="8" viewBox="0 0 5 8" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M0.458333 4.46667L3.78333 7.73334C4.01667 7.96667 4.36667 7.96667 4.6 7.73334C4.83333 7.50001 4.83333 7.15001 4.6 6.91667L1.74167 4.00001L4.6 1.08334C4.83333 0.850008 4.83333 0.500008 4.6 0.266675C4.48333 0.150008 4.36667 0.0916748 4.19167 0.0916748C4.01667 0.0916748 3.9 0.150008 3.78333 0.266675L0.458333 3.53334C0.225 3.82501 0.225 4.17501 0.458333 4.46667C0.458333 4.40834 0.458333 4.40834 0.458333 4.46667Z" fill="white" />
                        </svg></button></li>
                    <li className={styles.btn_border}><button className={`${styles.pagination_num_btn} ${styles.btn_selected}`}>1</button></li>
                    <li><button className={styles.pagination_num_btn}>2</button></li>
                    <li><button className={styles.pagination_num_btn}>3</button></li>
                    <li><button className={styles.pagination_num_btn}>4</button></li>
                    <li><button className={styles.pagination_num_btn}>...</button></li>
                    <li><button className={`${styles.pagination_num_btn} ${styles.pagination_num_btn1}`}>
                        <svg width="5" height="8" viewBox="0 0 5 8" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M4.56501 3.58581L1.26334 0.289981C1.20911 0.235306 1.1446 0.191909 1.07351 0.162294C1.00243 0.132679 0.926183 0.117432 0.849176 0.117432C0.77217 0.117432 0.695925 0.132679 0.62484 0.162294C0.553755 0.191909 0.489238 0.235306 0.43501 0.289981C0.326363 0.399275 0.265381 0.547122 0.265381 0.701231C0.265381 0.855339 0.326363 1.00319 0.43501 1.11248L3.32251 4.02915L0.43501 6.91665C0.326363 7.02594 0.265381 7.17379 0.265381 7.3279C0.265381 7.48201 0.326363 7.62985 0.43501 7.73915C0.489035 7.79426 0.553461 7.83811 0.624555 7.86815C0.695649 7.89819 0.771997 7.91383 0.849176 7.91415C0.926356 7.91383 1.0027 7.89819 1.0738 7.86815C1.14489 7.83811 1.20932 7.79426 1.26334 7.73915L4.56501 4.44331C4.62422 4.38869 4.67148 4.32239 4.7038 4.2486C4.73612 4.17481 4.7528 4.09512 4.7528 4.01456C4.7528 3.934 4.73612 3.85432 4.7038 3.78053C4.67148 3.70674 4.62422 3.64044 4.56501 3.58581Z" fill="white" />
                        </svg>
                    </button></li>
                </ul>
            </div>

        </div>
    )
}

export default BodyContent;